/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50519
Source Host           : localhost:3306
Source Database       : software_engineering

Target Server Type    : MYSQL
Target Server Version : 50519
File Encoding         : 65001

Date: 2019-06-02 16:10:28
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `online_test`
-- ----------------------------
DROP TABLE IF EXISTS `online_test`;
CREATE TABLE `online_test` (
  `ol_hw_id` int(10) NOT NULL AUTO_INCREMENT,
  `kno_type` varchar(20) NOT NULL,
  `question` varchar(255) NOT NULL,
  `choiceA` varchar(255) NOT NULL,
  `choiceB` varchar(255) NOT NULL,
  `choiceC` varchar(255) NOT NULL,
  `choiceD` varchar(255) NOT NULL,
  `answer` varchar(255) NOT NULL,
  `true_freq` int(10) NOT NULL,
  `ans_freq` int(10) NOT NULL,
  PRIMARY KEY (`ol_hw_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of online_test
-- ----------------------------
INSERT INTO `online_test` VALUES ('1', '10001', '软件是一种逻辑产品，它的开发主要是（）', '研制', '拷贝', '再生产', '复制', 'A', '33', '100');
INSERT INTO `online_test` VALUES ('2', '10001', '在分析模型中，用来描述数据对象及其关系的图形语言机制是（ ）', 'PDL', '状态转换图', '数据流', '实体关系图', 'A', '33', '100');
INSERT INTO `online_test` VALUES ('3', '10001', '软件生命周期一般包括：软件开发期和软件运行期，下述（）不是软件开发期所应包含的内容', '需求分析', '结构设计', '程序编制', '软件维护', 'D', '23', '100');
INSERT INTO `online_test` VALUES ('4', '10001', '以文档作为驱动，适合于软件需求很明确的软件项目的生存周期模型是（）', '喷泉模型', '增量模型', '瀑布模型', '螺旋模型', 'C', '34', '100');
INSERT INTO `online_test` VALUES ('5', '10001', '在软件生存周期中，（）阶段必须要回答的问题是“要解决的问题是做什么？”', '详细设计', '可行性分析和项目开发计划', '概要设计', '软件测试', 'B', '12', '100');
INSERT INTO `online_test` VALUES ('6', '10001', '软件产品与物质产品有很大区别，软件产品是一种（）产品', '有形', '消耗', '逻辑', '文档', 'C', '13', '100');
INSERT INTO `online_test` VALUES ('7', '10001', '( )把瀑布模型和专家系统结合在一起，在开发的各个阶段上都利用相应的专家系统来帮助软件人员完成开发工作。', '原型模型', '螺旋模型', '基于知识的智能模型', '喷泉模型', 'D', '12', '100');
INSERT INTO `online_test` VALUES ('8', '10001', ' (  )阶段是为每个模块完成的功能进行具体的描述，要把功能描述转变为精确的、结构化的过程描述。', '概要设计', '详细设计', '编码', '测试', 'B', '45', '100');
INSERT INTO `online_test` VALUES ('9', '10001', '下列软件开发模型中，适合于那些不能预先确切定义需求的软件系统的开发的模型是（ ）', '原型模型', '瀑布模型', '基于知识的智能模型 ', '变换模型', 'A', '65', '100');
INSERT INTO `online_test` VALUES ('10', '10001', '下列软件开发模型中，以面向对象的软件开发方法为基础，以用户的需求为动力，以对象来驱动的模型是（ ）', '原型模型', '瀑布模型', '喷泉模型', '螺旋模型', 'C', '13', '100');
INSERT INTO `online_test` VALUES ('11', '10002', '以下关于软件需求分析的叙述中，不正确的是（）', '软件需求分析阶段的任务是描述出软件架构及相关组件之间的接口', '软件需求分析可以检测和解决需求之间的冲突', '软件需求分析可以确定系统的边界', '软件需求分析是软件工程中的一个关键过程', 'A', '43', '100');
INSERT INTO `online_test` VALUES ('12', '10002', '以下关于软件需求变更的叙述中，不正确的是（）', '每一个需求变更都必须能追溯到一个经核准的变更请求', '变更控制过程本身应该形成文档', '所有需求变更必须遵循变更控制过程', '需求变更后，可以删除原始的需求文档', 'D', '11', '100');
INSERT INTO `online_test` VALUES ('13', '10002', '需求分析阶段的任务是确定（）', '软件开发方法', '软件开发工具', '软件开发费用', '软件开发功能', 'D', '77', '100');
INSERT INTO `online_test` VALUES ('14', '10002', '下列不属于需求分析工具的是（）', '数据流图', '用例图', '状态图', '程序流程图', 'D', '23', '100');
INSERT INTO `online_test` VALUES ('15', '10002', '在软件工程的需求分析阶段，不属于问题识别内容的是（）', '输入／输出需求', '性能需求', '环境需求', '功能需求', 'A', '43', '100');
INSERT INTO `online_test` VALUES ('16', '10002', '软件需求规格说明书的作用不包括（）', '软件验收的依据', '软件设计的依据', '软件可行性研究的依据', '用户与开发人员对软件要做什么的共同理解', 'C', '44', '100');
INSERT INTO `online_test` VALUES ('17', '10002', '软件需求分析阶段建立原型的主要目地是（ ）', '确定系统的性能要求', '确定系统的运行要求', '确定系统是否满足用户需要', '确定系统是否满足开发人员需要', 'C', '76', '100');
INSERT INTO `online_test` VALUES ('18', '10002', '软件开发中需求分析的主要任务是（）', '给出软件解决方案', '给出系统模块结构', '定义模块算法', '定义需求并建立系统模型', 'D', '43', '100');
INSERT INTO `online_test` VALUES ('19', '10002', '需求分析阶段最重要的技术文档是（）', '项目开发计划', '设计说明书', '需求规格说明书', '可行性分析报告', 'C', '54', '100');
INSERT INTO `online_test` VALUES ('20', '10002', '在软件需求分析中，开发人员要从用户那里解决的最重要问题是（ ）', '要让软件做什么', '要给该软件提供哪些信息', '要求软件工作效率怎样 ', '要让软件具有何种结构', 'A', '12', '100');
INSERT INTO `online_test` VALUES ('21', '10003', '下面哪项不是风险管理的过程（）', '风险评估', '风险识别', '风险规划', '风险收集', 'D', '72', '100');
INSERT INTO `online_test` VALUES ('22', '10003', '在风险分析中使用灵敏度分析可以（ ）', '在风险定量中取代不确定性分析', '估算管理层对风险的厌恶级别', '估算一个项目变量变更对整个项目的影响', '理解达到项目目标的概率', 'C', '11', '100');
INSERT INTO `online_test` VALUES ('23', '10003', '以下各项关于回避风险的陈述除了（）都是正确的', '消除引起风险的因素', '决定不对风险过高的项目进行投标', '风险倘若发生,就接受后果', '决定取消采用具有高风险的新技术，而采用原来熟悉的技术', 'C', '22', '100');
INSERT INTO `online_test` VALUES ('24', '10003', '在靠近河边的某建筑工地，洪水毁坏了所有挖掘的地基，这是发生了什么类型的风险?()', '已知风险（Known knowns）', '可预测风险（Known unknowns）', '不可预测风险（unknown unknowns）', '其他', 'B', '12', '100');
INSERT INTO `online_test` VALUES ('25', '10003', '在风险分析过程中，确定已经识别的一个风险事件是无法避免的，也是不能减轻的，也不能投保，这是一个关键的风险事件，一旦发生可能造成项目的失败，项目经理最佳的选择是（ ）', '降低风险的级别，项目团队将找到一个克服故障的方法', '特别关注，加强管理该风险事件和所有的相关事件', '让风险评估小组继续分析该风险事件，直到降低预期影响', '忽略风险评估，因为不管赋予什么值，都只是一个估算', 'B', '12', '100');
INSERT INTO `online_test` VALUES ('26', '10003', '风险的三个属性是（ ）', '风险发生的时间、地点、负责人', '风险事件、时间、影响', '风险事件、概率、影响', '风险数量、风险影响程度、概率', 'C', '76', '100');
INSERT INTO `online_test` VALUES ('27', '10003', '购买保险是（ ）类型的风险处理策略', '风险转移', '风险规避', '风险抑制', '风险自担', 'A', '65', '100');
INSERT INTO `online_test` VALUES ('28', '10003', '在什么情况下可以采用德尔菲方法进行风险识别（）', '存在模拟模型', '需要大家的统一意见', '有大量历史项目', '风险概率明确', 'B', '54', '100');
INSERT INTO `online_test` VALUES ('29', '10003', '下面哪一项不属于风险评估方法（ ）', '盈亏平衡分析', '模拟法', '决策树分析', '二叉树分析', 'D', '54', '100');
INSERT INTO `online_test` VALUES ('30', '10003', '下面哪一项不属于风险应对策略（）', '回避风险', '忽略风险', '转移风险', '损失控制', 'B', '90', '100');
INSERT INTO `online_test` VALUES ('31', '10004', '软件测试的目的是（ ）', '试验性运行软件', '发现软件错误', '证明软件正确  ', '找出软件中全部错误', 'B', '67', '100');
INSERT INTO `online_test` VALUES ('32', '10004', '软件测试中白盒法是通过分析程序的（ ）来设计测试用例的', '应用范围', '内部逻辑', '功能', '输入数据', 'B', '78', '100');
INSERT INTO `online_test` VALUES ('33', '10004', '黑盒法是根据程序的（  ）来设计测试用例的', '应用范围', '内部逻辑', '功能', '输入数据', 'C', '34', '100');
INSERT INTO `online_test` VALUES ('34', '10004', '为了提高软件测试的效率，应该（ ）', '随机地选取测试数据', '取一切可能的输入数据作为测试数据', '在完成编码以后制定软件的测试计划', '选择发现错误可能性最大的数据作为测试用例', 'D', '45', '100');
INSERT INTO `online_test` VALUES ('35', '10004', '与设计测试用例无关的文档是（ ）', '项目开发计划', '需求规格说明书', '设计说明书', '源程序', 'A', '23', '100');
INSERT INTO `online_test` VALUES ('36', '10004', '测试的关键问题是（ ）', '如何组织软件评审', '如何选择测试用例', '如何验证程序的正确性', '如何采用综合策略', 'B', '21', '100');
INSERT INTO `online_test` VALUES ('37', '10004', '软件测试用例主要由输入数据和（ ）两部分组成。', '测试计划', '测试规则', '预期输出结果', '以往测试记录分析', 'C', '34', '100');
INSERT INTO `online_test` VALUES ('38', '10004', '成功的测试是指运行测试用例后（）', '未发现程序错误', '发现了程序错误', '证明程序正确性', '改正了程序错误', 'B', '78', '100');
INSERT INTO `online_test` VALUES ('39', '10004', '下列几种逻辑覆盖标准中，查错能力最强的是（）', '语句覆盖', '判定覆盖', '条件覆盖', '条件组合覆盖', 'D', '12', '100');
INSERT INTO `online_test` VALUES ('40', '10004', '在黑盒测试中，着重检查输入条件组合的方法是（）', '等价类划分法', '边界值分析法', '错误推测法', '因果图法', 'D', '76', '100');
